wrk_rps_merged/425
Running 5m test @ http://10.96.216.233:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 659.517ms, rate sampling interval: 1967ms
  Thread calibration: mean lat.: 716.570ms, rate sampling interval: 2549ms
  Thread calibration: mean lat.: 679.506ms, rate sampling interval: 2543ms
  Thread calibration: mean lat.: 721.474ms, rate sampling interval: 2340ms
  Thread calibration: mean lat.: 740.026ms, rate sampling interval: 2588ms
  Thread calibration: mean lat.: 719.044ms, rate sampling interval: 2539ms
  Thread calibration: mean lat.: 703.166ms, rate sampling interval: 2557ms
  Thread calibration: mean lat.: 704.258ms, rate sampling interval: 2555ms
  Thread calibration: mean lat.: 691.200ms, rate sampling interval: 2543ms
  Thread calibration: mean lat.: 715.802ms, rate sampling interval: 2543ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   961.58ms  608.52ms   5.91s    74.90%
    Req/Sec     9.54      1.84    16.00     90.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  870.91ms
 75.000%    1.27s 
 90.000%    1.70s 
 99.000%    2.99s 
 99.900%    4.49s 
 99.990%    5.57s 
 99.999%    5.91s 
100.000%    5.91s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.196     0.000000            1         1.00
     300.543     0.100000         2900         1.11
     500.223     0.200000         5819         1.25
     615.935     0.300000         8697         1.43
     770.047     0.400000        11633         1.67
     870.911     0.500000        14504         2.00
     897.023     0.550000        15951         2.22
     969.727     0.600000        17430         2.50
    1003.519     0.650000        18852         2.86
    1167.359     0.700000        20295         3.33
    1272.831     0.750000        21750         4.00
    1303.551     0.775000        22473         4.44
    1382.399     0.800000        23196         5.00
    1466.367     0.825000        23928         5.71
    1504.255     0.850000        24642         6.67
    1594.367     0.875000        25377         8.00
    1669.119     0.887500        25736         8.89
    1696.767     0.900000        26102        10.00
    1773.567     0.912500        26455        11.43
    1836.031     0.925000        26814        13.33
    1907.711     0.937500        27182        16.00
    1980.415     0.943750        27359        17.78
    2019.327     0.950000        27539        20.00
    2168.831     0.956250        27730        22.86
    2271.231     0.962500        27924        26.67
    2373.631     0.968750        28084        32.00
    2469.887     0.971875        28192        35.56
    2502.655     0.975000        28265        40.00
    2582.527     0.978125        28356        45.71
    2670.591     0.981250        28453        53.33
    2766.847     0.984375        28536        64.00
    2793.471     0.985938        28583        71.11
    2871.295     0.987500        28626        80.00
    2912.255     0.989062        28671        91.43
    3008.511     0.990625        28717       106.67
    3190.783     0.992188        28762       128.00
    3287.039     0.992969        28786       142.22
    3397.631     0.993750        28809       160.00
    3475.455     0.994531        28831       182.86
    3565.567     0.995313        28855       213.33
    3610.623     0.996094        28875       256.00
    3698.687     0.996484        28887       284.44
    3794.943     0.996875        28898       320.00
    3878.911     0.997266        28910       365.71
    3909.631     0.997656        28921       426.67
    4009.983     0.998047        28932       512.00
    4165.631     0.998242        28938       568.89
    4280.319     0.998437        28943       640.00
    4370.431     0.998633        28949       731.43
    4464.639     0.998828        28956       853.33
    4497.407     0.999023        28960      1024.00
    4513.791     0.999121        28963      1137.78
    4603.903     0.999219        28968      1280.00
    4607.999     0.999316        28970      1462.86
    4702.207     0.999414        28973      1706.67
    4788.223     0.999512        28974      2048.00
    4870.143     0.999561        28976      2275.56
    4874.239     0.999609        28977      2560.00
    5017.599     0.999658        28979      2925.71
    5169.151     0.999707        28981      3413.33
    5169.151     0.999756        28981      4096.00
    5275.647     0.999780        28982      4551.11
    5369.855     0.999805        28983      5120.00
    5509.119     0.999829        28984      5851.43
    5509.119     0.999854        28984      6826.67
    5570.559     0.999878        28985      8192.00
    5570.559     0.999890        28985      9102.22
    5574.655     0.999902        28986     10240.00
    5574.655     0.999915        28986     11702.86
    5574.655     0.999927        28986     13653.33
    5607.423     0.999939        28987     16384.00
    5607.423     0.999945        28987     18204.44
    5607.423     0.999951        28987     20480.00
    5607.423     0.999957        28987     23405.71
    5607.423     0.999963        28987     27306.67
    5910.527     0.999969        28988     32768.00
    5910.527     1.000000        28988          inf
#[Mean    =      961.580, StdDeviation   =      608.523]
#[Max     =     5906.432, Total count    =        28988]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30003 requests in 5.00m, 157.36MB read
  Socket errors: connect 0, read 0, write 0, timeout 100
Requests/sec:     99.98
Transfer/sec:    536.98KB