wrk_rps_merged/447
Running 5m test @ http://10.98.173.188:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 214.690ms, rate sampling interval: 860ms
  Thread calibration: mean lat.: 211.936ms, rate sampling interval: 834ms
  Thread calibration: mean lat.: 231.293ms, rate sampling interval: 867ms
  Thread calibration: mean lat.: 225.631ms, rate sampling interval: 863ms
  Thread calibration: mean lat.: 223.852ms, rate sampling interval: 855ms
  Thread calibration: mean lat.: 224.327ms, rate sampling interval: 862ms
  Thread calibration: mean lat.: 241.172ms, rate sampling interval: 872ms
  Thread calibration: mean lat.: 233.984ms, rate sampling interval: 848ms
  Thread calibration: mean lat.: 232.760ms, rate sampling interval: 869ms
  Thread calibration: mean lat.: 239.761ms, rate sampling interval: 854ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   303.67ms  407.81ms  13.80s    95.79%
    Req/Sec     9.53      3.88    28.00     79.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  247.68ms
 75.000%  361.73ms
 90.000%  517.89ms
 99.000%    1.36s 
 99.900%    5.67s 
 99.990%   12.80s 
 99.999%   13.80s 
100.000%   13.80s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.478     0.000000            1         1.00
      44.831     0.100000         2903         1.11
     137.471     0.200000         5805         1.25
     157.055     0.300000         8729         1.43
     226.943     0.400000        11613         1.67
     247.679     0.500000        14510         2.00
     263.935     0.550000        15966         2.22
     318.207     0.600000        17444         2.50
     328.447     0.650000        18903         2.86
     339.711     0.700000        20330         3.33
     361.727     0.750000        21770         4.00
     413.951     0.775000        22493         4.44
     421.887     0.800000        23217         5.00
     429.055     0.825000        23945         5.71
     438.271     0.850000        24666         6.67
     451.839     0.875000        25391         8.00
     468.991     0.887500        25753         8.89
     517.887     0.900000        26116        10.00
     530.431     0.912500        26480        11.43
     541.695     0.925000        26848        13.33
     562.175     0.937500        27204        16.00
     621.055     0.943750        27388        17.78
     642.047     0.950000        27568        20.00
     674.303     0.956250        27748        22.86
     738.815     0.962500        27930        26.67
     806.911     0.968750        28111        32.00
     829.439     0.971875        28201        35.56
     845.823     0.975000        28292        40.00
     911.359     0.978125        28383        45.71
     941.567     0.981250        28478        53.33
     970.239     0.984375        28564        64.00
    1113.087     0.985938        28609        71.11
    1208.319     0.987500        28655        80.00
    1274.879     0.989062        28700        91.43
    1446.911     0.990625        28746       106.67
    1628.159     0.992188        28791       128.00
    1703.935     0.992969        28813       142.22
    1766.399     0.993750        28838       160.00
    1847.295     0.994531        28859       182.86
    1967.103     0.995313        28881       213.33
    2646.015     0.996094        28904       256.00
    2928.639     0.996484        28915       284.44
    3536.895     0.996875        28927       320.00
    3817.471     0.997266        28939       365.71
    3962.879     0.997656        28949       426.67
    4751.359     0.998047        28961       512.00
    4816.895     0.998242        28966       568.89
    4923.391     0.998437        28972       640.00
    5378.047     0.998633        28978       731.43
    5623.807     0.998828        28984       853.33
    5677.055     0.999023        28989      1024.00
    5730.303     0.999121        28992      1137.78
    5738.495     0.999219        28995      1280.00
    5816.319     0.999316        28998      1462.86
    5853.183     0.999414        29000      1706.67
    6852.607     0.999512        29003      2048.00
    7852.031     0.999561        29005      2275.56
    8830.975     0.999609        29006      2560.00
    9822.207     0.999658        29008      2925.71
    9838.591     0.999707        29009      3413.33
   10813.439     0.999756        29010      4096.00
   10829.823     0.999780        29011      4551.11
   11812.863     0.999805        29013      5120.00
   11812.863     0.999829        29013      5851.43
   11812.863     0.999854        29013      6826.67
   12804.095     0.999878        29015      8192.00
   12804.095     0.999890        29015      9102.22
   12804.095     0.999902        29015     10240.00
   12804.095     0.999915        29015     11702.86
   12804.095     0.999927        29015     13653.33
   13803.519     0.999939        29017     16384.00
   13803.519     1.000000        29017          inf
#[Mean    =      303.666, StdDeviation   =      407.809]
#[Max     =    13795.328, Total count    =        29017]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30057 requests in 5.00m, 146.53MB read
  Socket errors: connect 0, read 0, write 0, timeout 23
  Non-2xx or 3xx responses: 13
Requests/sec:    100.17
Transfer/sec:    500.07KB